# Fundamentals in Python - Numpy and Pandas
by Obed Rios.

**Book Resources:**

- *McKinney, W., Python for Data Analysis, OReilly, 2017*

**Web Resources:**

- https://github.com/wesm/pydata-book
- https://wesmckinney.com/book/
- https://docs.python.org/3/library/stdtypes.html#printf-style-string-formatting

## Numpy Basics: Vectorized and Array computing

**Web Resources**

- https://numpy.org

In [310]:
%matplotlib inline

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

### Numpy ndarray creation

The array function is the easiest way to create an array. Any sequence-like object (including other arrays) can be used to create a NumPy array containing the passed data.

In [7]:
# Create an array using arange
x = np.arange(10)
x

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [8]:
# Create an ndarray using a list
x = np.array([n for n in range(10)])
x

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [11]:
# Create n-dimensional ndarray using nested lists
x = np.array([[1,2,3],[4,5,6]])
x

array([[1, 2, 3],
       [4, 5, 6]])

In [32]:
# Query some essential properties of an array
print("Shape:(%s), No.Dimentions: %s" % (x.shape, x.ndim))
x.dtype

Shape:((2, 3)), No.Dimentions: 2

dtype('int64')

In [38]:
# Numpy matrices can be created in a way similar to MATLAB and R by following these steps:
x = np.zeros((3,1))
x

array([[0.],
       [0.],
       [0.]])

In [40]:
x = np.zeros((3,2))
x

array([[0., 0.],
       [0., 0.],
       [0., 0.]])

In [43]:
x = np.zeros((2,3,2))
x

array([[[0., 0.],
        [0., 0.],
        [0., 0.]],

       [[0., 0.],
        [0., 0.],
        [0., 0.]]])

In [57]:
x = np.ones((3,1))
x

array([[1.],
       [1.],
       [1.]])

In [54]:
np.eye(3,4)

array([[1., 0., 0., 0.],
       [0., 1., 0., 0.],
       [0., 0., 1., 0.]])

In [48]:
np.identity(4)

array([[1., 0., 0., 0.],
       [0., 1., 0., 0.],
       [0., 0., 1., 0.],
       [0., 0., 0., 1.]])

In [62]:
np.diag(np.array([1,2,3]))

array([[1, 0, 0],
       [0, 2, 0],
       [0, 0, 3]])

**Passing object references and copy ndarray objects**

In [119]:
# About ndarray object reference 
x = np.eye(3)
print('ObjRef: %s, %s' % (hex(id(x)), x.tolist()))

ObjRef: 0x7fcc07829630, [[1.0, 0.0, 0.0], [0.0, 1.0, 0.0], [0.0, 0.0, 1.0]]

In [120]:
# The next operation, just pass their reference
y = x
print('ObjRef: %s, %s' % (hex(id(y)), y.tolist()))

ObjRef: 0x7fcc07829630, [[1.0, 0.0, 0.0], [0.0, 1.0, 0.0], [0.0, 0.0, 1.0]]

In [121]:
y[:1, :] = np.array([1,1,1])
print('ObjRef: %s, %s' % (hex(id(y)), x.tolist()))

ObjRef: 0x7fcc07829630, [[1.0, 1.0, 1.0], [0.0, 1.0, 0.0], [0.0, 0.0, 1.0]]

In [122]:
# New object is created using copy
y = x.copy()
print('ObjRef: %s, %s' % (hex(id(y)), y.tolist()))

ObjRef: 0x7fcc07829270, [[1.0, 1.0, 1.0], [0.0, 1.0, 0.0], [0.0, 0.0, 1.0]]

In [128]:
# We may observe now 'y' object with distinct obj-ref
y[:1, :] = np.array([1,0,0])
print('y:=%s,\nx:=%s' % (y.tolist(), x.tolist()))

y:=[[1.0, 0.0, 0.0], [0.0, 1.0, 0.0], [0.0, 0.0, 1.0]],
x:=[[1.0, 1.0, 1.0], [0.0, 1.0, 0.0], [0.0, 0.0, 1.0]]

In [134]:
# Also, array() may be used to create a copy
z = np.array(x)
print( 'z:%s, x:%s'% (hex(id(z)), hex(id(x))))
print( 'z:=%s,\nx:=%s' % (z.tolist(), x.tolist()))

z:0x7fcc0854f5d0, x:0x7fcc07829630
z:=[[1.0, 1.0, 1.0], [0.0, 1.0, 0.0], [0.0, 0.0, 1.0]],
x:=[[1.0, 1.0, 1.0], [0.0, 1.0, 0.0], [0.0, 0.0, 1.0]]

## Simple Numpy array arithmetics

In [299]:
x = np.array([[1,2,3],[4,5,6],[7,8,9]])
y = np.ones((3,3))
#
print("x:=%s\ny:=%s" % (x.tolist(),y.tolist()))

x:=[[1, 2, 3], [4, 5, 6], [7, 8, 9]]
y:=[[1.0, 1.0, 1.0], [1.0, 1.0, 1.0], [1.0, 1.0, 1.0]]

In [300]:
# Simple addition
x + y

array([[ 2.,  3.,  4.],
       [ 5.,  6.,  7.],
       [ 8.,  9., 10.]])

In [301]:
# Hadamard product (element wise product)
x * y

array([[1., 2., 3.],
       [4., 5., 6.],
       [7., 8., 9.]])

In [302]:
# Transpose matrix
x.T # is the same as np.transpose(x)

array([[1, 4, 7],
       [2, 5, 8],
       [3, 6, 9]])

In [303]:
# Matrix multiplication
x.dot(y)

array([[ 6.,  6.,  6.],
       [15., 15., 15.],
       [24., 24., 24.]])

In [304]:
# Dot product of 1st row againts 1 column
x[0, :].dot(y[:, 0])

6.0

In [305]:
# Also si possible to perform dot product using
np.dot(x[0, :], y[:, 0])

6.0

In [306]:
x < 4

array([[ True,  True,  True],
       [False, False, False],
       [False, False, False]])

In [307]:
x[x < 4] = np.array([0,0,0])
x

array([[0, 0, 0],
       [4, 5, 6],
       [7, 8, 9]])

In [309]:
square = lambda x: x**2
square(x)

array([[ 0,  0,  0],
       [16, 25, 36],
       [49, 64, 81]])

### Array Indexing and Slicing

In [283]:
# Let the following matrix
x = np.array([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]])
x

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16]])

In [284]:
# Select the two first rows
x[:2]

array([[1, 2, 3, 4],
       [5, 6, 7, 8]])

In [285]:
# Select the two first columns
x[:, :2]

array([[ 1,  2],
       [ 5,  6],
       [ 9, 10],
       [13, 14]])

In [286]:
# Select the last two rows
x[2:]

array([[ 9, 10, 11, 12],
       [13, 14, 15, 16]])

In [287]:
# Select the last two columns
x[:, 2:]

array([[ 3,  4],
       [ 7,  8],
       [11, 12],
       [15, 16]])

**Inspectig reference and copy using slice: Example 1**

In [288]:
# Let the following matrix and their slice
x = np.array([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]])
y = x[1:3, 1:3]
print("x.ref:%s, y.ref:%s, %s" % (hex(id(x)), hex(id(y)), y.tolist()))

x.ref:0x7fcc085c49f0, y.ref:0x7fcc086ae8d0, [[6, 7], [10, 11]]

In [289]:
# Now we set to zeros into 'x' object as follows
y[:,:] = np.zeros((2,2)) #Caution: it's not the same y = np.zeros(2,2) because this creates new object
x

array([[ 1,  2,  3,  4],
       [ 5,  0,  0,  8],
       [ 9,  0,  0, 12],
       [13, 14, 15, 16]])

In [290]:
# Now, performing copy() explicitly
x = np.array([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]])
y = x[1:3,1:3].copy()
print("x.ref:%s, y.ref:%s, %s" % (hex(id(x)), hex(id(y)), y.tolist()))

x.ref:0x7fcc085c4ab0, y.ref:0x7fcc086aea50, [[6, 7], [10, 11]]

In [291]:
# We avoid overwriting the original matrix by using copy
y[:,:] = np.zeros((2,2))
x

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16]])

**Multidimensional and Stack Indexing and Slicing**

In [292]:
# Let the following stacked matrices structure array
# that is 3 x 2 x 3 = 3 matrices of dims 2 x 3
x = np.array([[[1, 2, 3], [4, 5, 6]], 
                  [[7, 8, 9], [10, 11, 12]],
                  [[13, 14, 15], [16, 17, 18]]
                 ])
print("Stacked Matrices structure:\n", x)
print("ndims:=%s, shape:=%s " % (x.ndim, x.shape))

Stacked Matrices structure:
 [[[ 1  2  3]
  [ 4  5  6]]

 [[ 7  8  9]
  [10 11 12]]

 [[13 14 15]
  [16 17 18]]]
ndims:=3, shape:=(3, 2, 3)

In [293]:
# Select the last two arrays(matrices)
x[1:,:,:]

array([[[ 7,  8,  9],
        [10, 11, 12]],

       [[13, 14, 15],
        [16, 17, 18]]])

In [294]:
# Select the second array
x[1, :, :]

array([[ 7,  8,  9],
       [10, 11, 12]])

In [295]:
# Now lets overwrite the first row of the first array with zeros:
x[1, 0, :] = np.zeros(3)
x[1, :, :]

array([[ 0,  0,  0],
       [10, 11, 12]])

In [296]:
# We may extract the first stacked array and overwrite it as follows:
y = x[1, :, :]
y[:,:] = np.eye(2,3)
x

array([[[ 1,  2,  3],
        [ 4,  5,  6]],

       [[ 1,  0,  0],
        [ 0,  1,  0]],

       [[13, 14, 15],
        [16, 17, 18]]])

In [298]:
# Transpose the selected matrix
x[1, :, :].T

array([[1, 0],
       [0, 1],
       [0, 0]])

### Other array operations

In [312]:
# Let the following 1D array
x = np.arange(9)
x

array([0, 1, 2, 3, 4, 5, 6, 7, 8])

In [318]:
x = x.reshape(3,3) # it's the same as np.reshape(x, (3,3))
x

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

## Numpy: Linear Algebra Operations

Python for Data Analysis: Chapter 4.4

## Pandas Basics: Series and DataFrame data structures

**Web Resources**

- https://pandas.pydata.org

### Pandas Series data structure

A Series is a one-dimensional array-like object containing a sequence of values (of similar types to NumPy types) and an associated array of data labels, called its index.

> You may think about a Series as a fixed-length, ordered dict, as it is a mapping of index values to data values

**Creation of pandas series objects**

In [710]:
pd.DataFrame([['a', 1], ['b', 2]], columns=['letter', 'number'], index=['row1', 'row2'])

     letter  number
row1      a       1
row2      b       2

In [332]:
# Series creation using numpy array
pd.Series(np.arange(4))

0    0
1    1
2    2
3    3
dtype: int64

In [333]:
pd.Series({'a':1, 'b':2, 'c':3, 'd':4})

a    1
b    2
c    3
d    4
dtype: int64

In [334]:
# Series data structure creation without indexes
x = pd.Series([1,2,3,4])
print(x)

0    1
1    2
2    3
3    4
dtype: int64

In [335]:
# Series data structure creation with indexes
x = pd.Series([1,2,3,4], index = ['a','b','c','d'])
print(x)

a    1
b    2
c    3
d    4
dtype: int64

In [336]:
# Query values properties of an pd.Series object
x.values

array([1, 2, 3, 4])

In [337]:
x.index

Index(['a', 'b', 'c', 'd'], dtype='object')

**Modifying and indexing pd.Series**

In [420]:
carnames = ["Mazda RX4", "Mazda RX4 Wag", "Datsun 710", "Hornet 4 Drive", "Hornet Sportabout", "Valiant", 
"Duster 360", "Merc 240D", "Merc 230", "Merc 280", "Merc 280C", "Merc 450SE", "Merc 450SL", "Merc 450SLC",
"Cadillac Fleetwood", "Lincoln Continental", "Chrysler Imperial", "Fiat 128", "Honda Civic", "Toyota Corolla",
"Toyota Corona", "Dodge Challenger", "AMC Javelin", "Camaro Z28", "Pontiac Firebird", "Fiat X1-9",
"Porsche 914-2", "Lotus Europa", "Ford Pantera L", "Ferrari Dino", "Maserati Bora", "Volvo 142E"]

mpg = [1,21,22.8,21.4,18.7,18.1,14.3,24.4,22.8,19.2,17.8,16.4,
       17.3,15.2,10.4,10.4,14.7,32.4,30.4,33.9,21.5,15.5,15.2,13.3,
       19.2,27.3,26,30.4,15.8,19.7,15,21.4]

hp = [110,110,93,110,175,105,245,62,95,123,123,180,180,180,205,215,
      230,66,52,65,97,150,150,245,175,66,91,113,264,175,335,109]
#
cars = pd.Series(mpg, index = carnames)
cars.name = "mtcars"
cars.index.name = 'Car Name'
cars

Car Name
Mazda RX4               1.0
Mazda RX4 Wag          21.0
Datsun 710             22.8
Hornet 4 Drive         21.4
Hornet Sportabout      18.7
Valiant                18.1
Duster 360             14.3
Merc 240D              24.4
Merc 230               22.8
Merc 280               19.2
Merc 280C              17.8
Merc 450SE             16.4
Merc 450SL             17.3
Merc 450SLC            15.2
Cadillac Fleetwood     10.4
Lincoln Continental    10.4
Chrysler Imperial      14.7
Fiat 128               32.4
Honda Civic            30.4
Toyota Corolla         33.9
Toyota Corona          21.5
Dodge Challenger       15.5
AMC Javelin            15.2
Camaro Z28             13.3
Pontiac Firebird       19.2
Fiat X1-9              27.3
Porsche 914-2          26.0
Lotus Europa           30.4
Ford Pantera L         15.8
Ferrari Dino           19.7
Maserati Bora          15.0
Volvo 142E             21.4
Name: mtcars, dtype: float64

In [406]:
# Single value query
cars['Volvo 142E']

21.4

In [407]:
# Multiple values query
cars[['Merc 280', 'Fiat 128']]

Car Name
Merc 280    19.2
Fiat 128    32.4
Name: mtcars, dtype: float64

In [408]:
# Multiple values modify
cars[['Merc 280', 'Fiat 128']] = 1.0
cars[['Merc 280', 'Fiat 128']]

Car Name
Merc 280    1.0
Fiat 128    1.0
Name: mtcars, dtype: float64

In [409]:
# Select using predicates
cars[cars < 10]

Car Name
Mazda RX4    1.0
Merc 280     1.0
Fiat 128     1.0
Name: mtcars, dtype: float64

In [410]:
cars[3:7]

Car Name
Hornet 4 Drive       21.4
Hornet Sportabout    18.7
Valiant              18.1
Duster 360           14.3
Name: mtcars, dtype: float64

In [411]:
cars['New Car 1'] = 1.0
cars[-2:]

Car Name
Volvo 142E    21.4
New Car 1      1.0
Name: mtcars, dtype: float64

**pd.Series interesting methods**

In [412]:
cars.describe()

count    33.000000
mean     17.403030
std       8.277133
min       1.000000
25%      14.700000
50%      17.800000
75%      21.500000
max      33.900000
Name: mtcars, dtype: float64

In [413]:
cars.mean()

17.403030303030306

In [418]:
cars[0:3].isnull()

Car Name
Mazda RX4        False
Mazda RX4 Wag    False
Datsun 710       False
Name: mtcars, dtype: bool

In [419]:
cars[0:3].isna()

Car Name
Mazda RX4        False
Mazda RX4 Wag    False
Datsun 710       False
Name: mtcars, dtype: bool

In [415]:
square = lambda x: x**2
square(cars[1:3])

Car Name
Mazda RX4 Wag    441.00
Datsun 710       519.84
Name: mtcars, dtype: float64

### Pandas DataFrame data structure

A DataFrame represents a rectangular table of data and contains an ordered collection of columns, each of which can be a different value type (numeric, string, boolean, etc.). The DataFrame has both a row and column index; it can be thought of as a dict of Series all sharing the same index.

While a DataFrame is physically two-dimensional, you can use it to represent higher dimensional data in a tabular format using hierarchical indexing.

#### Creation of DataFrame objects

In [421]:
# Let the follwing data be specified:

carnames = ["Mazda RX4", "Mazda RX4 Wag", "Datsun 710", "Hornet 4 Drive", "Hornet Sportabout", "Valiant", 
"Duster 360", "Merc 240D", "Merc 230", "Merc 280", "Merc 280C", "Merc 450SE", "Merc 450SL", "Merc 450SLC",
"Cadillac Fleetwood", "Lincoln Continental", "Chrysler Imperial", "Fiat 128", "Honda Civic", "Toyota Corolla",
"Toyota Corona", "Dodge Challenger", "AMC Javelin", "Camaro Z28", "Pontiac Firebird", "Fiat X1-9",
"Porsche 914-2", "Lotus Europa", "Ford Pantera L", "Ferrari Dino", "Maserati Bora", "Volvo 142E"]

mpg = [1,21,22.8,21.4,18.7,18.1,14.3,24.4,22.8,19.2,17.8,16.4,
       17.3,15.2,10.4,10.4,14.7,32.4,30.4,33.9,21.5,15.5,15.2,13.3,
       19.2,27.3,26,30.4,15.8,19.7,15,21.4]

hp = [110,110,93,110,175,105,245,62,95,123,123,180,180,180,205,215,
      230,66,52,65,97,150,150,245,175,66,91,113,264,175,335,109]

In [424]:
# Data Frame creation with default index
pd.DataFrame({'mpg':mpg, 'hp':hp}).head()

    mpg   hp
0   1.0  110
1  21.0  110
2  22.8   93
3  21.4  110
4  18.7  175

In [429]:
# Data Frame creation using index
mtcars = pd.DataFrame({'mpg':mpg, 'hp':hp}, columns=['hp', 'mpg'], index=carnames)
mtcars.head()

                    hp   mpg
Mazda RX4          110   1.0
Mazda RX4 Wag      110  21.0
Datsun 710          93  22.8
Hornet 4 Drive     110  21.4
Hornet Sportabout  175  18.7

In [434]:
# DataFrame creation using existing DataFrame and adding a new column
wt = [2.62,2.875,2.32,3.215,3.44,3.46,3.57,3.19,3.15,3.44,
      3.44,4.07,3.73,3.78,5.25,5.424,5.345,2.2,1.615,1.835,
      2.465,3.52,3.435,3.84,3.845,1.935,2.14,1.513,3.17,2.77,3.57,2.78]

x = pd.DataFrame(mtcars.head(), columns = ['hp','mpg','wt'])
x

                    hp   mpg  wt
Mazda RX4          110   1.0 NaN
Mazda RX4 Wag      110  21.0 NaN
Datsun 710          93  22.8 NaN
Hornet 4 Drive     110  21.4 NaN
Hornet Sportabout  175  18.7 NaN

In [441]:
# Later you may assign the values using:
x.loc[:, 'wt'] = wt[1:6]
x

                    hp   mpg     wt
Mazda RX4          110   1.0  2.875
Mazda RX4 Wag      110  21.0  2.320
Datsun 710          93  22.8  3.215
Hornet 4 Drive     110  21.4  3.440
Hornet Sportabout  175  18.7  3.460

In [649]:
# Create Data Frame using pd.Series
# pd.DataFrame({'mpg':pd.Series(mpg),'hp':pd.Series(hp)}, index = carnames) -> setting index will produce Nas
x = pd.DataFrame({'mpg':pd.Series(mpg),'hp':pd.Series(hp)})
x.index = carnames # Later we may set index
x.head()

                    mpg   hp
Mazda RX4           1.0  110
Mazda RX4 Wag      21.0  110
Datsun 710         22.8   93
Hornet 4 Drive     21.4  110
Hornet Sportabout  18.7  175

In [823]:
# Also we may create an empty data frame with index
x = pd.DataFrame(columns = ['mpg','hp'], index = carnames)
x.loc[:, ['mpg','hp']] = np.array([mpg, hp]).T # Dimensions should match
x.head()

                    mpg     hp
Mazda RX4           1.0  110.0
Mazda RX4 Wag      21.0  110.0
Datsun 710         22.8   93.0
Hornet 4 Drive     21.4  110.0
Hornet Sportabout  18.7  175.0

In [814]:
# Other way to create a dataframe is by using concat pd.Series along axis=1 (columns)
x = pd.concat([pd.Series(mpg),pd.Series(hp)], axis=1)
x.columns = pd.Index(['mpg','hp'])
x.index = pd.Index(carnames)
x.index.name='Car Names'
x.head()

                    mpg   hp
Car Names
Mazda RX4           1.0  110
Mazda RX4 Wag      21.0  110
Datsun 710         22.8   93
Hornet 4 Drive     21.4  110
Hornet Sportabout  18.7  175

#### Modify and Index DataFrames

In [815]:
x = pd.DataFrame(columns = ['mpg','hp'], index = carnames)
x.loc[:, ['mpg','hp']] = np.array([mpg, hp]).T # Dimensions should match
x.head()

                    mpg     hp
Mazda RX4           1.0  110.0
Mazda RX4 Wag      21.0  110.0
Datsun 710         22.8   93.0
Hornet 4 Drive     21.4  110.0
Hornet Sportabout  18.7  175.0

In [792]:
# Querying values from a DataFrame
x.head().values

array([[1.0, 110.0],
       [21.0, 110.0],
       [22.8, 93.0],
       [21.4, 110.0],
       [18.7, 175.0]], dtype=object)

In [879]:
# It'is possible to access columns through key names directly
x.mpg.head()

Mazda RX4             1.0
Mazda RX4 Wag        21.0
Datsun 710           22.8
Hornet 4 Drive       21.4
Hornet Sportabout    18.7
Name: mpg, dtype: object

In [793]:
x[x['mpg'] < 10]

           mpg     hp
Mazda RX4  1.0  110.0

In [794]:
x[x.loc[:, 'mpg'] < 10]

           mpg     hp
Mazda RX4  1.0  110.0

In [795]:
# Append new Index value to Data Frame
x = pd.DataFrame(x, x.index.append(pd.Index(['New Car 1'])))
x[-2:]

# Insert random indexes into existing data frame
new_cars_index = np.arange(2,10)
np.random.shuffle(new_cars_index)
new_cars_names = np.array(["New Car {}".format(n) for n in new_cars_index])
#
for new_car in new_cars_names:
    x = pd.DataFrame(x, index = x.index.insert(np.random.randint(33), new_car))

In [796]:
# Verify those rows where a null value is present
x[x['mpg'].isnull()]

           mpg   hp
New Car 3  NaN  NaN
New Car 8  NaN  NaN
New Car 5  NaN  NaN
New Car 9  NaN  NaN
New Car 4  NaN  NaN
New Car 2  NaN  NaN
New Car 6  NaN  NaN
New Car 7  NaN  NaN
New Car 1  NaN  NaN

In [797]:
# Verify those rows where a null value is present
x[x.isnull().values[:,0]]

           mpg   hp
New Car 3  NaN  NaN
New Car 8  NaN  NaN
New Car 5  NaN  NaN
New Car 9  NaN  NaN
New Car 4  NaN  NaN
New Car 2  NaN  NaN
New Car 6  NaN  NaN
New Car 7  NaN  NaN
New Car 1  NaN  NaN

In [816]:
# Using append would be deprecate:
#x = x.append(pd.DataFrame({'mpg':np.random.randint(10,30,2)*1.5, 'hp':np.random.randint(100,500,2)}, 
#                        index=['Ferrari Testarosa', 'Lamborgini Countach']))
#
# Instead use concat:
# https://pandas.pydata.org/docs/reference/api/pandas.concat.html
# https://pandas.pydata.org/docs/user_guide/merging.html
x = pd.concat([x,pd.DataFrame({'mpg':np.random.randint(10,30,2)*1.5, 'hp':np.random.randint(100,500,2)}, 
                        index=['Ferrari Testarosa', 'Lamborgini Countach'])])
x[-2:]

                      mpg   hp
Ferrari Testarosa    24.0  340
Lamborgini Countach  19.5  244

In [836]:
# Add an empty column to a dataframe
x['wt'] = pd.NA
x.head()

                    mpg     hp    wt
Mazda RX4           1.0  110.0  <NA>
Mazda RX4 Wag      21.0  110.0  <NA>
Datsun 710         22.8   93.0  <NA>
Hornet 4 Drive     21.4  110.0  <NA>
Hornet Sportabout  18.7  175.0  <NA>

In [837]:
del x['wt']

#Add column to a dataframe
x = pd.concat([x, pd.DataFrame({'wt':wt}, index=x.index)], axis=1)
x.head()

                    mpg     hp     wt
Mazda RX4           1.0  110.0  2.620
Mazda RX4 Wag      21.0  110.0  2.875
Datsun 710         22.8   93.0  2.320
Hornet 4 Drive     21.4  110.0  3.215
Hornet Sportabout  18.7  175.0  3.440

In [842]:
#
employees_df = pd.DataFrame({
    'name':['John Doe', 'Jane Doe', 'Max Steel', 'Joane Constantine'],
    'email':['johndoe@unknown.edu', 'janedoe@unknown.com', 'max@agentsecret.com', 'magicthings@spells.com'],
    'id_department':[1,2,3,2]
})

#
department_df = pd.DataFrame({
    'id_department':[1,2,3,4,5],
    'department':['Communications', "Marketing Sales", 'Managment Staff', 'IT Department', 'Security']
})

#department_df.index.name = "id_department"

In [843]:
employees_df

                name                   email  id_department
0           John Doe     johndoe@unknown.edu              1
1           Jane Doe     janedoe@unknown.com              2
2          Max Steel     max@agentsecret.com              3
3  Joane Constantine  magicthings@spells.com              2

In [844]:
department_df

   id_department       department
0              1   Communications
1              2  Marketing Sales
2              3  Managment Staff
3              4    IT Department
4              5         Security

In [846]:
# Resources:
# https://pandas.pydata.org/docs/user_guide/merging.html
merged_df = pd.merge(employees_df, department_df, on='id_department', how='right').loc[:,['name','email','department']]
merged_df

                name                   email       department
0           John Doe     johndoe@unknown.edu   Communications
1           Jane Doe     janedoe@unknown.com  Marketing Sales
2  Joane Constantine  magicthings@spells.com  Marketing Sales
3          Max Steel     max@agentsecret.com  Managment Staff
4                NaN                     NaN    IT Department
5                NaN                     NaN         Security

In [856]:
merged_df.describe()

            name                email       department
count          4                    4                6
unique         4                    4                5
top     John Doe  johndoe@unknown.edu  Marketing Sales
freq           1                    1                2

In [911]:
# https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.applymap.html
merged_df.dropna().applymap(str.lower)

                name                   email       department
0           john doe     johndoe@unknown.edu   communications
1           jane doe     janedoe@unknown.com  marketing sales
2  joane constantine  magicthings@spells.com  marketing sales
3          max steel     max@agentsecret.com  managment staff

## Data Loading and Storage using Pandas

Data input and output typically fall into three categories: reading text files, loading data from databases, and interacting with network sources.

### Working with CSV Files

In [948]:
import csv

with open('mtcars.csv', 'r') as f:
    fcsv = csv.reader(f)
    rows = np.array(list(fcsv))
    
# Directly using data rows to create pd.DataFrame
header, filedata = rows[0], rows[1:]
mtcars = pd.DataFrame(filedata, columns=header).set_index('car_type')
mtcars.head()

                    mpg cyl disp   hp  drat     wt   qsec vs am gear carb
car_type
Mazda RX4            21   6  160  110   3.9   2.62  16.46  0  1    4    4
Mazda RX4 Wag        21   6  160  110   3.9  2.875  17.02  0  1    4    4
Datsun 710         22.8   4  108   93  3.85   2.32  18.61  1  1    4    1
Hornet 4 Drive     21.4   6  258  110  3.08  3.215  19.44  1  0    3    1
Hornet Sportabout  18.7   8  360  175  3.15   3.44  17.02  0  0    3    2

In [965]:
# Creating pd.DataFrame using data dictionary
data_dict = {h: v for h, v in zip(header, zip(*filedata))}
mtcars = pd.DataFrame(data_dict).set_index('car_type')
mtcars.head()

                    mpg cyl disp   hp  drat     wt   qsec vs am gear carb
car_type
Mazda RX4            21   6  160  110   3.9   2.62  16.46  0  1    4    4
Mazda RX4 Wag        21   6  160  110   3.9  2.875  17.02  0  1    4    4
Datsun 710         22.8   4  108   93  3.85   2.32  18.61  1  1    4    1
Hornet 4 Drive     21.4   6  258  110  3.08  3.215  19.44  1  0    3    1
Hornet Sportabout  18.7   8  360  175  3.15   3.44  17.02  0  0    3    2

In [966]:
# Load Data using pd.read_csv with first row header
mtcars = pd.read_csv('mtcars.csv', index_col=['car_type'])
mtcars.head()

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
car_type,,,,,,,,,,,
Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [1012]:
# Load Data using pd.read_csv with first row header
mtcars = pd.read_csv('mtcars.csv', index_col = ['car_type'])
mtcars.head()

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
car_type,,,,,,,,,,,
Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [960]:
pd.read_csv('mtcars.csv', header = None).head()

,0,1,2,3,4,5,6,7,8,9,10,11
0,car_type,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
1,Mazda RX4,21,6,160,110,3.9,2.62,16.46,0,1,4,4
2,Mazda RX4 Wag,21,6,160,110,3.9,2.875,17.02,0,1,4,4
3,Datsun 710,22.8,4,108,93,3.85,2.32,18.61,1,1,4,1
4,Hornet 4 Drive,21.4,6,258,110,3.08,3.215,19.44,1,0,3,1

In [1010]:
# Load Data using pd.read_csv and chunk partition
mtcars_chunks = pd.read_csv('mtcars.csv', index_col = ['car_type'], chunksize=10)
mtcars_chunks = list(mtcars_chunks)
print('Data Frames Chunks: %d' % len(mtcars_chunks))

Data Frames Chunks: 4

### Working with Excel Files

In [1020]:
xlsx_file = pd.ExcelFile('datasets_example.xlsx')
xlsx_file.sheet_names

['mtcars', 'wine']

In [1025]:
mtcars = pd.read_excel(xlsx_file, 'mtcars')
mtcars.set_index(['car_type'])
mtcars.head()

,car_type,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

### Working with JSON Files

## Worked Example with Pandas No.1
From McKinney, W., Python for Data Analytics, OReilly, 2017. Ch.5.3

In [864]:
import pandas_datareader.data as web

#
all_data = {ticker: web.get_data_yahoo(ticker) for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
print("Key in Dict: %s" % all_data.keys())

# Create Data Frame from dictionaries
price = pd.DataFrame({ticker: data['Adj Close'] for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})

Key in Dict: dict_keys(['AAPL', 'IBM', 'MSFT', 'GOOG'])

In [873]:
price.head(), volume.head()

(                 AAPL         IBM       MSFT       GOOG
 Date
 2017-10-02  36.493923  110.537613  70.107277  47.663502
 2017-10-03  36.652901  110.628044  69.778412  47.889500
 2017-10-04  36.415634  110.401909  70.182449  47.584000
 2017-10-05  36.868809  110.582817  71.385193  48.498001
 2017-10-06  36.847462  110.401909  71.413368  48.944500,
                   AAPL        IBM        MSFT        GOOG
 Date
 2017-10-02  74795200.0  3109967.0  15304800.0  25668000.0
 2017-10-03  64921200.0  2408624.0  12190400.0  17766000.0
 2017-10-04  80655200.0  2347642.0  13317700.0  19048000.0
 2017-10-05  85135200.0  2810079.0  21195300.0  24276000.0
 2017-10-06  69630400.0  2743867.0  13959800.0  23478000.0)

In [875]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2022-09-26  0.002260 -0.005704 -0.001975 -0.003630
2022-09-27  0.006566 -0.002213 -0.004380 -0.007287
2022-09-28 -0.012652  0.008379  0.019712  0.027016
2022-09-29 -0.049119 -0.009205 -0.014809  0.000000
2022-09-30 -0.030039 -0.023185 -0.019368 -0.045563

In [882]:
print("Two ways to access dataframe values: %s, %s" % (returns['MSFT'].corr(returns['IBM']), returns.MSFT.corr(returns.IBM)))

Two ways to access dataframe values: 0.4837495049146361, 0.4837495049146361

In [884]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.441622  0.761254  0.686488
IBM   0.441622  1.000000  0.483750  0.451874
MSFT  0.761254  0.483750  1.000000  0.790877
GOOG  0.686488  0.451874  0.790877  1.000000

In [885]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000419  0.000156  0.000294  0.000267
IBM   0.000156  0.000297  0.000157  0.000148
MSFT  0.000294  0.000157  0.000357  0.000284
GOOG  0.000267  0.000148  0.000284  0.000360